Make https-guard sent event right
